; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-6-8-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-2 - location
	p0-4 - location
	p1-2 - location
	p1-3 - location
	p2-0 - location
	p4-3 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s0)
	(at driver3 s3)
	(at driver4 s4)
	(at driver5 s0)
	(at driver6 s1)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at truck6 s1)
	(empty truck6)
	(at truck7 s0)
	(empty truck7)
	(at truck8 s1)
	(empty truck8)
	(at package1 s2)
	(at package2 s1)
	(at package3 s4)
	(at package4 s0)
	(at package5 s3)
	(at package6 s3)
	(at package7 s1)
	(at package8 s2)
	(at package9 s2)
	(at package10 s4)
	(at package11 s0)
	(at package12 s1)
	(at package13 s3)
	(at package14 s4)
	(at package15 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s3)
	(link s3 s0)
	(link s1 s4)
	(link s4 s1)
	(link s3 s1)
	(link s1 s3)
	(link s3 s2)
	(link s2 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s4)
	(at driver5 s3)
	(at driver6 s1)
	(at truck2 s3)
	(at truck4 s2)
	(at truck8 s2)
	(at package1 s2)
	(at package2 s3)
	(at package4 s2)
	(at package5 s0)
	(at package6 s3)
	(at package7 s2)
	(at package8 s4)
	(at package9 s4)
	(at package10 s1)
	(at package11 s4)
	(at package12 s1)
	(at package13 s1)
	(at package14 s1)
	(at package15 s4)
	))


)

; plan
1. (board-truck driver2 s0 truck1)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 6 of 21
2. (drive-truck driver2 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 6 of 21
3. (load-truck s4 package14 truck1)
   deleted: (at package14 s4)
   added: (in package14 truck1)
   goals met: 6 of 21
4. (drive-truck driver2 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 6 of 21
5. (load-truck s1 package7 truck1)
   deleted: (at package7 s1)
   added: (in package7 truck1)
   goals met: 6 of 21
6. (drive-truck driver2 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 6 of 21
7. (load-truck s3 package5 truck1)
   deleted: (at package5 s3)
   added: (in package5 truck1)
   goals met: 6 of 21
8. (drive-truck driver2 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 6 of 21
9. (unload-truck s0 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s0)
   goals met: 7 of 21
10. (load-truck s0 package4 truck1)
   deleted: (at package4 s0)
   added: (in package4 truck1)
   goals met: 7 of 21
11. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 7 of 21
12. (load-truck s2 package9 truck1)
   deleted: (at package9 s2)
   added: (in package9 truck1)
   goals met: 7 of 21
13. (drive-truck driver2 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 7 of 21
14. (load-truck s3 package13 truck1)
   deleted: (at package13 s3)
   added: (in package13 truck1)
   goals met: 7 of 21
15. (drive-truck driver2 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 7 of 21
16. (load-truck s1 package2 truck1)
   deleted: (at package2 s1)
   added: (in package2 truck1)
   goals met: 7 of 21
17. (drive-truck driver2 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 7 of 21
18. (unload-truck s3 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s3)
   goals met: 8 of 21
19. (drive-truck driver2 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 8 of 21
20. (unload-truck s4 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s4)
   goals met: 9 of 21
21. (load-truck s4 package10 truck1)
   deleted: (at package10 s4)
   added: (in package10 truck1)
   goals met: 9 of 21
22. (drive-truck driver2 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 9 of 21
23. (unload-truck s1 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s1)
   goals met: 10 of 21
24. (unload-truck s1 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s1)
   goals met: 11 of 21
25. (drive-truck driver2 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 11 of 21
26. (drive-truck driver2 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 11 of 21
27. (load-truck s2 package8 truck1)
   deleted: (at package8 s2)
   added: (in package8 truck1)
   goals met: 11 of 21
28. (unload-truck s2 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s2)
   goals met: 12 of 21
29. (drive-truck driver2 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 12 of 21
30. (drive-truck driver2 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 12 of 21
31. (unload-truck s4 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s4)
   goals met: 13 of 21
32. (board-truck driver5 s0 truck7)
   deleted: (at driver5 s0) (empty truck7)
   added: (driving driver5 truck7)
   goals met: 13 of 21
33. (load-truck s0 package11 truck7)
   deleted: (at package11 s0)
   added: (in package11 truck7)
   goals met: 13 of 21
34. (drive-truck driver5 s0 s3 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s3)
   goals met: 13 of 21
35. (board-truck driver1 s2 truck2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 12 of 21
36. (drive-truck driver2 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 12 of 21
37. (unload-truck s1 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s1)
   goals met: 13 of 21
38. (drive-truck driver2 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 13 of 21
39. (drive-truck driver2 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 13 of 21
40. (unload-truck s2 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 14 of 21
41. (drive-truck driver2 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 14 of 21
42. (drive-truck driver2 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 14 of 21
43. (disembark-truck driver2 s4 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 15 of 21
44. (drive-truck driver5 s3 s4 truck7)
   deleted: (at truck7 s3)
   added: (at truck7 s4)
   goals met: 15 of 21
45. (unload-truck s4 package11 truck7)
   deleted: (in package11 truck7)
   added: (at package11 s4)
   goals met: 16 of 21
46. (drive-truck driver5 s4 s3 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s3)
   goals met: 16 of 21
47. (disembark-truck driver5 s3 truck7)
   deleted: (driving driver5 truck7)
   added: (at driver5 s3) (empty truck7)
   goals met: 17 of 21
48. (disembark-truck driver1 s2 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 18 of 21
49. (load-truck s2 package15 truck4)
   deleted: (at package15 s2)
   added: (in package15 truck4)
   goals met: 18 of 21
50. (board-truck driver1 s2 truck4)
   deleted: (at driver1 s2) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 17 of 21
51. (drive-truck driver1 s2 s3 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s3)
   goals met: 16 of 21
52. (drive-truck driver1 s3 s4 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   goals met: 16 of 21
53. (unload-truck s4 package15 truck4)
   deleted: (in package15 truck4)
   added: (at package15 s4)
   goals met: 17 of 21
54. (walk driver6 s1 p1-2)
   deleted: (at driver6 s1)
   added: (at driver6 p1-2)
   goals met: 16 of 21
55. (drive-truck driver1 s4 s3 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   goals met: 16 of 21
56. (drive-truck driver1 s3 s2 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   goals met: 17 of 21
57. (walk driver6 p1-2 s2)
   deleted: (at driver6 p1-2)
   added: (at driver6 s2)
   goals met: 17 of 21
58. (board-truck driver6 s2 truck2)
   deleted: (at driver6 s2) (empty truck2)
   added: (driving driver6 truck2)
   goals met: 17 of 21
59. (drive-truck driver6 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 18 of 21
60. (drive-truck driver6 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 17 of 21
61. (disembark-truck driver6 s1 truck2)
   deleted: (driving driver6 truck2)
   added: (at driver6 s1) (empty truck2)
   goals met: 18 of 21
62. (disembark-truck driver1 s2 truck4)
   deleted: (driving driver1 truck4)
   added: (at driver1 s2) (empty truck4)
   goals met: 19 of 21
63. (board-truck driver6 s1 truck8)
   deleted: (at driver6 s1) (empty truck8)
   added: (driving driver6 truck8)
   goals met: 18 of 21
64. (drive-truck driver6 s1 s3 truck8)
   deleted: (at truck8 s1)
   added: (at truck8 s3)
   goals met: 18 of 21
65. (drive-truck driver6 s3 s2 truck8)
   deleted: (at truck8 s3)
   added: (at truck8 s2)
   goals met: 19 of 21
66. (disembark-truck driver6 s2 truck8)
   deleted: (driving driver6 truck8)
   added: (at driver6 s2) (empty truck8)
   goals met: 19 of 21
67. (walk driver5 s3 p1-3)
   deleted: (at driver5 s3)
   added: (at driver5 p1-3)
   goals met: 18 of 21
68. (walk driver5 p1-3 s1)
   deleted: (at driver5 p1-3)
   added: (at driver5 s1)
   goals met: 18 of 21
69. (board-truck driver5 s1 truck2)
   deleted: (at driver5 s1) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 18 of 21
70. (drive-truck driver5 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 19 of 21
71. (disembark-truck driver5 s3 truck2)
   deleted: (driving driver5 truck2)
   added: (at driver5 s3) (empty truck2)
   goals met: 20 of 21
72. (walk driver6 s2 p1-2)
   deleted: (at driver6 s2)
   added: (at driver6 p1-2)
   goals met: 20 of 21
73. (walk driver6 p1-2 s1)
   deleted: (at driver6 p1-2)
   added: (at driver6 s1)
   goals met: 21 of 21
